---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.CircuitNamingScheme
source: html/f3c7bdef-1158-15f1-7736-f6b19e41e9f2.htm
---
# CircuitNamingScheme Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.